// ধাপে ধাপে ব্যাখ্যা:
// আমরা sort মেথড ব্যবহার করবো

// sort() হলো জাভাস্ক্রিপ্টের একটি বিল্ট-ইন মেথড, যা অ্যারের উপাদানগুলো সাজাতে সাহায্য করে।
// ডিফল্টভাবে sort() স্ট্রিং হিসেবে কম্পেয়ার করে। কিন্তু, সংখ্যা (numbers) বা নির্দিষ্ট প্রোপার্টি অনুসারে সাজাতে চাইলে কম্পেয়ার ফাংশন দিতে হয়।
// কম্পেয়ার ফাংশন তৈরি করবো:

// (a, b) => a[key] - b[key] এই ফাংশনটি দুটি অবজেক্টের নির্দিষ্ট key-এর মানের মধ্যে পার্থক্য বের করে।
// যদি a[key] ছোট হয় b[key] থেকে, তাহলে নিচে চলে আসবে।
// যদি a[key] বড় হয় b[key] থেকে, তাহলে উপরে চলে আসবে।

// টাইম কমপ্লেক্সিটি:
// 👉 sort() এর কমপ্লেক্সিটি O(N log N), কারণ এটি QuickSort / MergeSort ব্যাবহার করে।


function sortByArr(arr,key) {
    return arr.sort((a,b) =>a[key] - b[key])
}

const man = [
    { name: "John", age: 25 },
  { name: "Alice", age: 30 },
  { name: "Bob", age: 20 }
]

console.log(sortByArr(man,"age"));